{
    "1": {
        "href": "#",
        "name": "web",
        "sublinks": {
            "1": {
                "name": "school commissions",
                "subprojs": {
                    "1": {
                        "name": "mBoggle 2.0 (Ikan Oh Ikan)",
                        "timestamp": "dec 2017 - may 2019",
                        "description": "We developed a new Malay word game to replace the existing one in the annual HCI Malay Boggle (mBoggle) competition. Players control a fish that pops alphabet bubbles to spell out Malay words. This is a fun and interactive way to engage MSP students, improve their Malay vocabulary, and promote greater interest in the Malay language. The mBoggle competition attracts about 200 MSP students from different schools in Singapore. From 2019 onwards, Ikan oh Ikan will be the game used in the competition. <em>*** the link works only on the school network</em>",
                        "tags": ["commission", "matter.js"],
                        "link": "https://mboggle.hci.edu.sg"
                    },
                    "2": {
                        "name": "情牵华岗",
                        "timestamp": "feb - mar 2019",
                        "description": "情牵华岗 is a website created for the Hwa Chong 100th Anniversary Heritage Tour, held on 9 March 2019. Using location services, it detects, highlights, and gives a brief introduction on Hwa Chong landmarks that are in close proximity to the visitor. It also acts as a guestbook that allows visitors to pen down messages as a record of the visit.",
                        "tags": ["commission"],
                        "link": "https://meeps123.github.io/hc100webapp/"
                    },
                    "3": {
                        "name": "tours.hci.edu.sg",
                        "timestamp": "dec 2019 - ongoing",
                        "description": "a completely revamped version of 情牵华岗. we got feedback after the 100th anniversary heritage trail that school management liked the website and wanted to expand it for future use to cover ALL tours, including SOO, teachers induction, JC orientation, HSC investiture, etc... The old interface has been preserved but is now a subpage of the new website. The new website's landing page shows ALL tours instead of landmarks. There is also a new Maps interface.",
                        "tags": ["commission", "openlayers", "WIP"],
                        "link": "https://zerui18.github.io/HCITours"                   
                    }
                }
            },
            "2": {
                "name": "standalone sites",
                "subprojs": {
                    "1": {
                        "name": "local storage example",
                        "timestamp": "jan 2017",
                        "description": "first time getting in touch with <code>localStorage</code>. the page remembers what color you have set the background to.",
                        "tags": ["localStorage"],
                        "hidden": true
                    },
                    "2": {
                        "name": "periodic table",
                        "timestamp": "jan 2017",
                        "description": "attempt at recreating the ptable found in <a href='https://ptable.org'>ptable.org</a>",
                        "tags": ["recreate", "WIP"],
                        "hidden": true
                    },
                    "3": {
                        "name": "win10 start screen",
                        "timestamp": "feb 2017",
                        "description": "attempt at recreating the win10 start screen",
                        "tags": ["recreate"]
                    },
                    "4": {
                        "name": "damn counter",
                        "timestamp": "mar 2017",
                        "description": "another project that makes use of <code>localStorage</code>. a half useless damn counter that allows you to give X number of damns about a certain topic",
                        "tags": ["localStorage"],
                        "hidden": true
                        
                    },
                    "5": {
                        "name": "the 25th hour",
                        "timestamp": "june 2017",
                        "description": "attempt at creating an animation loop of the day/night cycle",
                        "tags": ["anim"]
                    },
                    "6": {
                        "name": "flappybird",
                        "timestamp": "may 2017",
                        "description": "flappy bird game created for demo purposes at the infocomm booth during 2017's HCI open house",
                        "tags": ["html5", "canvas"]
                    },
                    "7": {
                        "name": ".io game behaviour",
                        "timestamp": "june 2017",
                        "description": "tried to mimic how .io games allow users to move a character with the mouse",
                        "tags": ["html5", "canvas"],
                        "hidden": true
                    },
                    "8": {
                        "name": "polygon maker",
                        "timestamp": "jul 2017",
                        "description": "first ever <code>webgl</code> project. allows you to do xyz translation and define 4 vertices of a polygon.",
                        "tags": ["webgl"]
                    },
                    "9": {
                        "name": "gradient generator",
                        "timestamp": "jul 2017",
                        "description": "second <code>webgl</code> project. allows you to define <code>rgba()</code> values for 4 vertices of a square and blends the colours naturally. useful for creating colour wallpapers.",
                        "tags": ["webgl", "colour"] 
                    },
                    "10": {
                        "name": "spinning cube",
                        "timestamp": "jul 2017",
                        "description": "third <code>webgl</code> project. renders a 3D rotating cube.",
                        "tags": ["webgl"]
                    },
                    "11": {
                        "name": "astro duel web",
                        "timestamp": "dec 2017",
                        "description": "had an idea to create a web version of the game astro duel/party. has potential for further development. full credit goes to the original developers though, don't want to be implicated for stealing their idea",
                        "tags": ["html5", "canvas", "WIP"],
                        "hidden": true
                    },
                    "12": {
                        "name": "snek",
                        "timestamp": "june 2018",
                        "description": "snake game created with HTML5 canvas",
                        "tags": ["html5", "canvas"]
                    },
                    "13": {
                        "name": "cyto-helper",
                        "timestamp": "mar 2019",
                        "description": "first try at using CSS <code>flexbox</code>. a helper website to compute viable cell density and viable cell percentage based on number of replicates and dilution factor. makes it less tedious to do data collection when performing the trypan blue cell death assay.<br><br><em>Onload, the website will prompt for number of replicates & dilution factor. the information needs to be filled in as JS dynamically generates the hemocytometer A/B well layout. for testing purposes we can just input 3 and 100 (most common DF used for yeast)</em>",
                        "tags": ["flexbox"],
                        "link": "https://meeps123.github.io/cyto-helper/"
                    },
                    "14": {
                        "name": "chemcom2019",
                        "timestamp": "june 2019",
                        "description": "companion website made for team entry for the NUS Chemistry Communication Challenge 2019. our selected theme was metal organic frameworks. website made using bootstrap 4. left scrollspy sidebar inspiration taken from <a href='https://brm.io/matter-js'>matter.js libdocs</a>. matter.js was also used to create a model for the commercial application of metal organic frameworks for CO2 adsorption. citations dynamically generated based on txt file using JS.",
                        "tags": ["bootstrap", "matter.js"],
                        "link": "https://meeps123.github.io/chemcom2019/page1.html"
                    }
                }
            },
            "3": {
                "name": "chrome extensions",
                "subprojs": {
                    "1": {
                        "name": "clock newtab",
                        "timestamp": "oct 2017",
                        "description": "first time making a Chrome extension. overrides the default home page to a minimalist B&W clock.",
                        "tags": ["chrome-extension"],
                        "link": "https://github.com/meeps123/clock-newtab"
                    },
                    "2": {
                        "name": "sleep controller",
                        "timestamp": "feb 2018",
                        "description": "second time making a chrome extension. when it is time to get off the computer, the extension alerts() and upon confirmation, closes Chrome",
                        "tags": ["chrome-extension"],
                        "link": "https://github.com/meeps123/sleep-controller"
                    }
                }
            }
        }
    },
    "2": {
        "href": "#p2",
        "name": "AI/ML",
        "subprojs": {
            "1": {
                "name": "predicting HDB prices",
                "timestamp": "9 Jan 2020",
                "description": "first ever try at anything ML related. this was part of a walkthrough done by AI Singapore's AI4E initiative. Used Microsoft's Azure ML studio to perform a linear regression on open HDB data from 1999. based on 4 factors, flat type, storey range, flat model & town, plot the data as vectors in a 4 dimensional space, then find the 'best fit line'. Didn't do that well though, R<sup>2</sup> error is 70,000+...",
                "tags": ["msAzure"]
            },
            "2": {
                "name": "cyto-counter",
                "timestamp": "future",
                "description": "use image recognition to detect dead/live cells under a hemocytometer and count them when performing the trypan blue cell death assay. saves a lot of eye strain when looking at light from the microscope, and makes it less tedious to do cell counting. although there are already commercial solutions available, no harm to try making a budget solution that the HCI lab can use (they probably rich enough to buy machine tho lol)",
                "tags": ["image recognition", "WIP"],
                "link": "#"
            }
        }
    },
    "3": {
        "href": "#",
        "name": "app",
        "sublinks": {
            "1": {
                "name": "android",
                "subprojs": {
                    "1": {
                        "name": "FullUse",
                        "timestamp": "2017",
                        "description": "first try at making an Android app. used this app for IS 2017 and also for [i.code] 2017 where it won 2nd Place and Best User Experience. FullUse is a to do list app that makes use of a novel concept of splitting your tasks into the short term and long term. By completing tasks, you keep your pet 'tree' alive - a concept adapted from <a href='https://www.forestapp.cc/'>ForestApp</a>.",
                        "tags": ["android"],
                        "link": "https://meeps123.github.io/fulluse/"
                    },
                    "2": {
                        "name": "U.Plan()",
                        "timestamp": "mid 2017",
                        "description": "the original app that was supposed to be used for [i.code] 2017. eventually abandoned due to a lack of time. ",
                        "tags": ["android"]
                    },
                    "3": {
                        "name": "图战",
                        "timestamp": "nov 2017 - sep 2018",
                        "description": "app entry for the Singapore Centre for Chinese Learning's competition, 2018年全国学生华文应用程序制作比赛. the theme that we got for the app was: 职业 (occupations). the app is based off <a href='https://play.google.com/store/apps/details?id=fr.two4tea.fightlist&hl=en_SG'>Fight List</a>. users compete against one another to guess the definitions of occupations in chinese based on an image prompt. and then they can revise the vocab learnt through a flashcards system. <br><br> the app was chosen as a finalist along with 19 other apps and eventually won a top 20 excellence award. All finalists were also called up to present at the 2018 5th International Conference on Teaching and Learning of Chinese as a Second Language @ suntec city. <br><br> <em>图战 used to be on the play store until SCCL pulled all competition entries recently. however, you can still find the writeup done by the organizers on <a href='https://appcompetition.tk.sg/download/'>their competition webpage</a>. Scroll down till you find our app. Alternatively click this card to see screenshots of the app or competition website.</em>",
                        "tags": ["android"]
                    },
                    "4": {
                        "name": "findingOpponentAnim",
                        "timestamp": "dec 2017",
                        "description": "this project is a Web export of an android <code>AnimatedVectorDrawable</code> that was one of the animation ideas for finding an opponent in the 图战 game. The animation uses SVG path morphing to transform a search magnifying glass into a clock & back again. Made with <a href='https://shapeshifter.design/'>shapeshifter.design</a>.",
                        "tags": ["android", "AnimatedVectorDrawable"]
                    },
                    "5": {
                        "name": "VibrationTester",
                        "timestamp": "feb 2019",
                        "description": "first try at doing an android app in <code>Kotlin</code>. VibrationTester is an android app that vibrates the phone at regular intervals to test the tactic engine. Coded this app because my phone's call vibration was weird after dropping it.",
                        "tags": ["android"],
                        "link": "https://github.com/meeps123/vibrationtester"
                    },
                    "6": {
                        "name": "Connite",
                        "timestamp": "mar - 19 may 2019",
                        "description": "Entry for the competition Build On Singapore 2019 organized by amazon web services. Connite is an app targeted at the elderly. It aims to ensure that they maintain an active lifestyle. It suggests activities such as exercise, recreation etc based on nearby place of interest (POI) data from google maps API.",
                        "tags": ["android"]
                    }
                }
            },
            "2": {
                "name": "react",
                "subprojs": {
                    "1": {
                        "name": "pocketloopstation",
                        "timestamp": "future",
                        "description": "loopstation emulator in react for cross platform support. Existing apps for loopstation aren't that great. You do have garageband but the learning curve for that is quite steep. Try to mimic a professional loopstation using user friendly features.",
                        "tags": ["react", "bbx", "WIP"]
                    }
                }
            }
        }
    },
    "4": {
        "href": "#p4",
        "name": "VR/AR/MR",
        "subprojs": {}
    },
    "5": {
        "href": "#p5",
        "name": "fintech",
        "subprojs": {}
    }
}